kwakeham/nrf52_CX/nRF5_SDK/components/drivers_ext/drv2605/drv2605.c
/******************************************************************************
 * Haptics.c
 *
 * Created on: Dec 16, 2011
 * Board: DRV2604EVM-CT, DRV2605EVM-CT
 *
 * Description: This file contains the functions for sending haptics waveforms.
 * 		Edit this file when changing actuators.
 *
 * Last Updated: Nov 30, 2012
 ******************************************************************************/
// #include "Haptics.h"
// #include "DRV2605.h"
// #include "CapTouchBoard.h"
// #include "I2C.h"
// #include "Timer.h"
// #include "ActuatorSettings.h"

//stuff to port this to nrf52 series
#include "nrf_drv_twi.h"
#include "DRV260x.h" // register stuff
#include "DRV2605.h" // the main header file
#include "app_error.h"
#include "nrf_delay.h"

// #if DRV2604
// #include "WaveformData.h"
// #endif

//define the actuator, this might need some tunning, but not tuna
#define LRA_AUTOCAL_COMP        0x09                    // Compensation Coef.
#define LRA_AUTOCAL_BEMF        0x79                    // BEMF Coef.
#define LRA_AUTOCAL_FB          0xB6 //was b6                    // Feedback Control
#define LRA_RATED_VOLTAGE       VoltageRMS_LRA_RV_2p0   // Rated voltage
#define LRA_OVERDRIVE_VOLTAGE   Voltage_3p0             // Overdrive voltage
#define LRA_CTRL2               SampleTime_300us | BlankingTime_Medium | IDissTime_Medium   // Control Register 2
#define LRA_CTRL3               LRADriveMode_once | LRA_ClosedLoop     
#define AUTOCALRESULTS_LRA 1

// I'm probably doing  the instance stuff wrong?
#define TWI_INSTANCE_ID1     0
static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID1);

// Private variables
//static uint16_t tickdelay;
static uint8_t 	playEffect = 1;						// If 1 = play, 0 = do not play
static uint8_t 	EffectActive = 0;					// Flag if effect is playing
static uint8_t 	triggerType = TRIGGER_EXTERNAL_EDGE;		// Trigger Setting
static uint8_t 	actuatorType = ACTUATOR_LRA;		// Actuator Setting
static uint8_t  disableAllowed = 1;					// Flag if hardware disable is allowed
static uint8_t  IsERMOpenLoop = ERM_ClosedLoop;		// Flag for ERM Open Loop
static uint8_t  IsLRAOpenLoop = LRA_AutoResonance;	// Flag for ERM Open Loop
static uint8_t  useERMAutoCalValues = 0;			// Flag to use ERM auto-cal values
static uint8_t  useLRAAutoCalValues = 0;			// Flag to use LRA auto-cal values

/* DRV260x Register Variables */
static uint8_t 	ERM_AutoCal_Comp, ERM_AutoCal_BEMF, ERM_AutoCal_FB;
static uint8_t 	LRA_AutoCal_Comp, LRA_AutoCal_BEMF, LRA_AutoCal_FB;
static uint8_t 	ERM_RatedVoltage, ERM_ODClamp, ERM_ODClamp_OL;
static uint8_t 	LRA_RatedVoltage, LRA_ODClamp;
static uint8_t 	AutoCal_Result;
static uint8_t 	control1, control2, control3;
static uint8_t  ERMDefaultOpenLoopSetting, LRADefaultOpenLoopSetting;
uint16_t RDS_Comp_temp;


void I2C_WriteSingleByte(uint8_t DRV260x_REG, uint8_t DRV260x_DATA)
{
	ret_code_t err_code;
	/* Writing to LM75B_REG_CONF "0" set temperature sensor in NORMAL mode. */
	uint8_t reg[2] = {DRV260x_REG, DRV260x_DATA};
	err_code = nrf_drv_twi_tx(&m_twi, DRV2605_ADDR, reg, sizeof(reg), false);
	APP_ERROR_CHECK(err_code);		
}

uint8_t I2C_ReadSingleByte(uint8_t DRV260x_REG)
{
		ret_code_t err_code;
		uint8_t sample_data;
		err_code = nrf_drv_twi_tx(&m_twi, DRV2605_ADDR, &DRV260x_REG, 1, true);
		if (NRF_SUCCESS == err_code){
				err_code = nrf_drv_twi_rx(&m_twi, DRV2605_ADDR, &sample_data, 1);
		}
		APP_ERROR_CHECK(err_code);
		return sample_data;		
}

/**
 * Haptics_Init - initialize haptics variables and settings
 * This should be run once at device power up
 */
void Haptics_Init(void)
{
	//tickdelay = (unsigned int) TICKDELAY;

	// Set DRV260x Hardware Controls
	Haptics_EnableAmplifier();							// Enable the DRV260x
	Haptics_LoadSwitchSelect(ACTUATOR_ERM);     		// Select ERM using load switch

	// DRV260x Initialization
	I2C_WriteSingleByte(DRV260x_MODE, ACTIVE);    		// Exit STANDBY
	I2C_WriteSingleByte(DRV260x_RTP, 0x00);				// Set RTP register to zero, prevent playback
	I2C_WriteSingleByte(DRV260x_WAVEFORMSEQ1, 0x01);	// Insert waveform 1 into sequence register 1
	I2C_WriteSingleByte(DRV260x_WAVEFORMSEQ2, 0x00);	// Insert termination character in sequence register 2
	I2C_WriteSingleByte(DRV260x_ODT, 0x00);				// Set Library Overdrive time to zero
	//I2C_WriteSingleByte(DRV260x_ODT,0x80);
	I2C_WriteSingleByte(DRV260x_SPT, 0x00);				// Set Library Sustain positive time
	I2C_WriteSingleByte(DRV260x_SNT, 0x00);				// Set Library Sustain negative time
	I2C_WriteSingleByte(DRV260x_BRT, 0x00);				// Set Library Brake Time
	I2C_WriteSingleByte(0x13, 0x64);  					// A2H Vpeak maximum

#if DRV2604
	// Load header into RAM
	I2C_WriteSingleByte(DRV2604_RAMADDR_UB, 0x00);
	I2C_WriteSingleByte(DRV2604_RAMADDR_LB, 0x00);
	I2C_WriteMultiByte((unsigned char*) DRV2604_HEADER, DRV2604_HEADERSIZE);	// Send header data

	// Load waveform data into RAM
	I2C_WriteSingleByte(DRV2604_RAMADDR_UB, 0x01);
	I2C_WriteSingleByte(DRV2604_RAMADDR_LB, 0x00);
	I2C_WriteMultiByte((unsigned char*) DRV2604_DATA, DRV2604_DATASIZE);		// Send waveform data
#endif

	Haptics_SetControlRegisters();		// Set control register values
}

/**
 * Haptics_SetControlRegisters - set the control register variables
 */
void Haptics_SetControlRegisters(void)
{
	/* Set the Default control register values, see Haptics.h to define*/
	control1 = DEFAULT_CTRL1;
	control2 = DEFAULT_CTRL2;
	control3 = DEFAULT_CTRL3;

	/* @TODO - If DEFAULTCONTROLSETTINGS = 1 in ActuatorSettings.h, the program will use the
	 * 			CRTL2 and CTRL3 #defines from ActuatorsSettings.h.  See ActuatorSettings.h for more details.
	 *       Control Register 2: AutoResGain, BlankingTime, IDissTime
	 *       Control Register 3: ERM_OpenLoop, LRA_DriveMode, LRA_OpenLoop		*/
	#if DEFAULTCONTROLSETTINGS
	/* Set Control2
	 * Equivalent: control2 = [(AutoResGain | BlankingTime | IDissTime) & LRA_CTRL2] |
	 * 		[(BiDir_Input | Brake_Stabilizer) & control2] */
	control2 = (0x3F & LRA_CTRL2) | (0xC0 & control2);

	/* Set Control3
	 * Equivalent: control3 = [(ERM_OpenLoop | LRA_DriveMode | LRA_OpenLoop) & (ERM_CTRL3 | LRA_CTRL3)] |
	 * 		[(NG_Thresh | SupplyCompDis | DataFormat_RTP | nPWM_Analog) & control3] */
	control3 = (0x25 & (ERM_CTRL3 | LRA_CTRL3)) | (0xDA & control3);
	#endif

	ERMDefaultOpenLoopSetting = control3 & ERM_OpenLoop;	// Store ERM open-loop bit
	LRADefaultOpenLoopSetting = control3 & LRA_OpenLoop;	// Store LRA open-loop bit
}

/**
 * Haptics_RunAutoCal_LRA - run auto-calibration for an ERM actuator
 */
void Haptics_RunAutoCal_ERM(void)
{
	unsigned char i;

	/* Set Hardware Control */
	Haptics_EnableAmplifier();
	Haptics_LoadSwitchSelect(ACTUATOR_ERM);

	/* Load settings from ActuatorSettings.h */
	// ERM_AutoCal_FB = ERM_AUTOCAL_FB;
	// ERM_AutoCal_Comp = ERM_AUTOCAL_COMP;
	// ERM_AutoCal_BEMF = ERM_AUTOCAL_BEMF;
	// ERM_RatedVoltage = ERM_RATED_VOLTAGE;
	// ERM_ODClamp = ERM_OVERDRIVE_VOLTAGE;
	// ERM_ODClamp_OL = ERM_OVERDRIVE_OL;

	/* Set DRV260x Control Registers */
	I2C_WriteSingleByte(DRV260x_RATED_VOLTAGE, ERM_RatedVoltage);
	I2C_WriteSingleByte(DRV260x_OD_CLAMP, ERM_ODClamp);
	I2C_WriteSingleByte(DRV260x_FEEDBACK_CONTROL, ERM_AutoCal_FB);
	I2C_WriteSingleByte(DRV260x_CONTROL1, control1);
	I2C_WriteSingleByte(DRV260x_CONTROL2, control2);
	I2C_WriteSingleByte(DRV260x_CONTROL3, control3);

	/* Run AutoCal ERM */
	I2C_WriteSingleByte(DRV260x_MODE, Auto_Calibration);
	I2C_WriteSingleByte(DRV260x_AUTOCAL_MEMIF, AutoCalTime_500MS);
	I2C_WriteSingleByte(DRV260x_GO, GO);

	// Poll GO bit until it AutoCal is finished
	nrf_delay_ms(50);
	while(I2C_ReadSingleByte(DRV260x_GO) == GO)
		nrf_delay_ms(5);

