kwakeham/nrf52_CX/nRF5_SDK/components/drivers_ext/drv2605/drv2605.c
#if AUTOCALRESULTS_ERM		/* Use auto-calibration results */
	useERMAutoCalValues = 1;
#endif

	if(useERMAutoCalValues)	/* Use auto-calibration results */
	{
		ERM_AutoCal_Comp 	= I2C_ReadSingleByte(DRV260x_AUTOCAL_COMP);
		ERM_AutoCal_BEMF 	= I2C_ReadSingleByte(DRV260x_AUTOCAL_BEMF);
		ERM_AutoCal_FB 		= I2C_ReadSingleByte(DRV260x_FEEDBACK_CONTROL);
	}

	/* Check if AutoCal was Successful */
	AutoCal_Result = I2C_ReadSingleByte(DRV260x_STATUS);	// Check Status Register
	AutoCal_Result = (AutoCal_Result & 0x08) >> 3;

	/* 500 ms delay */
	//for(i=0;i<100;i++)
	nrf_delay_ms(50);

	//if(AutoCal_Result)
			//CapTouch_FlashModeLEDs(3);	// Auto-cal Fail
		//else
			//CapTouch_FlashModeLEDs(1);  // Auto-cal Pass

	I2C_WriteSingleByte(DRV260x_MODE, ACTIVE | Int_Trig);	// Set to int. trigger mode
	Haptics_DisableAmplifier();
}

/**
 * Haptics_RunAutoCal_LRA - run auto-calibration for an LRA actuator
 */
void Haptics_RunAutoCal_LRA(void)
{
	Haptics_EnableAmplifier();
	Haptics_LoadSwitchSelect(ACTUATOR_LRA);

	/* Store settings from ActuatorSettings.h in variables for reuse */
	LRA_AutoCal_FB = LRA_AUTOCAL_FB;
	LRA_AutoCal_Comp = LRA_AUTOCAL_COMP;
	LRA_AutoCal_BEMF = LRA_AUTOCAL_BEMF;
	LRA_RatedVoltage = LRA_RATED_VOLTAGE;
	LRA_ODClamp = LRA_OVERDRIVE_VOLTAGE;

	/* Setup Auto-calibration for LRA */
	I2C_WriteSingleByte(DRV260x_RATED_VOLTAGE, LRA_RatedVoltage);
	I2C_WriteSingleByte(DRV260x_OD_CLAMP, LRA_ODClamp);
	I2C_WriteSingleByte(DRV260x_FEEDBACK_CONTROL, LRA_AutoCal_FB);
	I2C_WriteSingleByte(DRV260x_CONTROL1, control1);
	I2C_WriteSingleByte(DRV260x_CONTROL2, control2);
	I2C_WriteSingleByte(DRV260x_CONTROL3, control3);

	/* Run Auto-calibration */
	I2C_WriteSingleByte(DRV260x_MODE, Auto_Calibration);
	I2C_WriteSingleByte(DRV260x_AUTOCAL_MEMIF, AutoCalTime_1000MS);
	I2C_WriteSingleByte(DRV260x_GO, GO);

	/* Poll GO bit until it AutoCal is finished */
	nrf_delay_ms(50);
	while(I2C_ReadSingleByte(DRV260x_GO) == GO)
		nrf_delay_ms(50);

	#if AUTOCALRESULTS_LRA	/* Use auto-calibration results */
		useLRAAutoCalValues = 1;
	#endif

	if(useLRAAutoCalValues)
	{
		LRA_AutoCal_Comp = I2C_ReadSingleByte(DRV260x_AUTOCAL_COMP);
		LRA_AutoCal_BEMF = I2C_ReadSingleByte(DRV260x_AUTOCAL_BEMF);
		LRA_AutoCal_FB 	 = I2C_ReadSingleByte(DRV260x_FEEDBACK_CONTROL);
	}

	/* Check if AutoCal was Successful */
	AutoCal_Result = I2C_ReadSingleByte(DRV260x_STATUS);
	AutoCal_Result = (AutoCal_Result & 0x08) >> 3;

//	if(AutoCal_Result)
//		CapTouch_FlashModeLEDs(3);	//Fail
//	else
//		CapTouch_FlashModeLEDs(1);  //Pass

	I2C_WriteSingleByte(DRV260x_MODE, ACTIVE | Int_Trig);	// Set to internal trigger mode
	Haptics_DisableAmplifier();
}

/**
 * Haptics_RecordAutoCalValues - save auto-calibration values
 */
void Haptics_RecordAutoCalValues(uint8_t recordAutoCal)
{
	useLRAAutoCalValues = 1;
	useERMAutoCalValues = 1;
}

/**
 * Haptics_Diagnostics - run actuator diagnostics
 * @param actuator - unsigned char - actuator constant (ACTUATOR_ERM, ACTUATOR_LRA)
 * @return unsigned char - DRV260x status register
 */
unsigned char Haptics_Diagnostics(uint8_t actuator)
{
	unsigned char diagResults = 0;

	Haptics_EnableAmplifier();
	Haptics_LoadSwitchSelect(actuator);					// Set load switch to specified actuator
	Haptics_SetActuator(actuator);						// Select the actuator
	Haptics_SendActuatorSettings();						// Send the actuator settings to the DRV260x

	I2C_WriteSingleByte(DRV260x_MODE, Diagnostics);		// Set mode to Diagnostics
	I2C_WriteSingleByte(DRV260x_GO, GO);				// Begin Diagnostics

	/* Poll GO bit until it Diagnostics is finished */
	nrf_delay_ms(50);
	while(I2C_ReadSingleByte(DRV260x_GO) == GO)
		nrf_delay_ms(50);

	diagResults = I2C_ReadSingleByte(DRV260x_STATUS);	// Get status register values

//	if((diagResults & 0x08))			// If fail
//		CapTouch_FlashModeLEDs(3);
//	else
//		CapTouch_FlashModeLEDs(1);  	// Else Pass

	Haptics_DisableAmplifier();

	return diagResults;
}

/**
 * Haptics_SendWaveformDefault- send haptic waveform using previously
 * 		selected actuator and trigger.
 * @param struct Waveform - the waveform output type, length in bytes, and data
 */
void Haptics_SendWaveformDefault(const Waveform waveform)
{
	if(playEffect)
	{
		Haptics_Start(waveform.inputMode);			// Enable the amplifier, begin PWM (if required)
		Haptics_HardwareMode(waveform.inputMode);	// Configure the Hardware (load switch, GPIOs)
		Haptics_SendTriggerType();					// Send trigger type to DRV260x
		Haptics_SendActuatorSettings();				// Send actuator settings to DRV260x

		Haptics_DisableTriggerActive(); 			// Stop waveform playback

		Haptics_OutputWaveform(waveform);			// Send waveform data to driver

		/* Stop PWM and RTP output when finished */
		if(waveform.inputMode == MODE_PWM || waveform.inputMode == MODE_RTP)
			Haptics_Stop(waveform.inputMode);
	}
}

/**
 * Haptics_SendWaveform - send haptic waveform
 * @param struct Waveform - the waveform input type, length in bytes, and data
 * @param unsigned char actuator - actuator type
 * @param unsigned char trigger - trigger type (internal, ext. edge, ext. level)
 */
void Haptics_SendWaveform(const Waveform waveform, const uint8_t actuator, const uint8_t trigger)
{
	if(playEffect)
	{
		actuatorType = actuator;					// Set actuator type
		triggerType = trigger;						// Set trigger type

		Haptics_Start(waveform.inputMode);			// Enable the amplifier, begin PWM (if required)
		Haptics_HardwareMode(waveform.inputMode);	// Configure the Hardware (load switch, GPIOs)
		Haptics_SendTriggerType();					// Send trigger type to DRV260x
		Haptics_SendActuatorSettings();				// Send actuator settings to DRV260x

		Haptics_DisableTriggerActive();				// Stop waveform playback

		Haptics_OutputWaveform(waveform);			// Send waveform data to driver

		/* Stop PWM and RTP output when finished */
		if(waveform.inputMode == MODE_PWM || waveform.inputMode == MODE_RTP)
			Haptics_Stop(waveform.inputMode);
	}
}

/**
 * Haptics_SendWaveform - send haptic waveform
 * @param struct Waveform - the waveform output type, length in bytes, and data
 */
void Haptics_OutputWaveform(const Waveform waveform)
{
	uint8_t i, j, k;
	uint8_t ReadVal;

