kwakeham/nrf52_CX/nRF5_SDK/components/drivers_ext/drv2605/drv2605.c
	if(triggerType == TRIGGER_INTERNAL)
	{
		I2C_WriteSingleByte(DRV260x_GO, GO);   		// Set Go bit with I2C
	}
	else if(triggerType == TRIGGER_EXTERNAL_EDGE)
	{
					//need to re-write for nordic
//		P3OUT |= 0x04;								// Set Trigger Pin High
//		timerdelay(100);
//		P3OUT &= 0xFB;								// Set Trigger Pin Low
	}
	else if(triggerType == TRIGGER_EXTERNAL_LEVEL)
	{
					//need to re-write for nordic
//		P3OUT |= 0x04;								// Set Trigger Pin High
	}
}

/**
 * Haptics_DisableTriggerActive - turn off the active trigger
 */
void Haptics_DisableTriggerActive(void)
{
	if(Haptics_IsEffectActive())
	{
		Haptics_EffectActive(0);

		if(triggerType == TRIGGER_INTERNAL)
		{
			I2C_WriteSingleByte(DRV260x_GO, STOP);   	// Set Go bit with I2C
		}
		else if(triggerType == TRIGGER_EXTERNAL_EDGE)
		{
						//need to re-write for nordic
//			P3OUT |= 0x04;								// Set Trigger Pin High
//			timerdelay(100);
//			P3OUT &= 0xFB;								// Set Trigger Pin Low
		}
		else if(triggerType == TRIGGER_EXTERNAL_LEVEL)
		{
						//need to re-write for nordic
//			P3OUT &= ~0x04;								// Set Trigger Pin Low
		}
	}
}

/**
 * Haptics_DisableTriggerActive - turn off the trigger specified
 * @param trigger - unsigned int - trigger type
 */
void Haptics_DisableTrigger(uint8_t trigger)
{
	Haptics_EffectActive(0);

	if(trigger == TRIGGER_INTERNAL)
	{
		I2C_WriteSingleByte(DRV260x_GO, STOP);   	// Set Go bit with I2C
	}
	else if(trigger == TRIGGER_EXTERNAL_EDGE)
	{
					//need to re-write for nordic
//		P3OUT |= 0x04;								// Set Trigger Pin High
//		timerdelay(100);
//		P3OUT &= 0xFB;								// Set Trigger Pin Low
	}
	else if(trigger == TRIGGER_EXTERNAL_LEVEL)
	{
					//need to re-write for nordic
//		P3OUT &= ~0x04;								// Set Trigger Pin Low
	}
}


/**
 * Haptics_StartPWM - Initialize PWM clocks and enable the haptics driver
 * @param unsigned char inputMode - the input mode of the current waveform
 */
void Haptics_Start(uint8_t inputMode)
{
	if(playEffect)
	{
		Haptics_EnableAmplifier();

		if(inputMode == MODE_PWM)		// If PWM mode
		{
			//need to re-write for nordic
//			/* Setup PWM registers */
//			TA1R=0;                        	// Reset PWM Count
//			TA1CCTL1 |= OUTMOD_7 + CCIE;   	// PWM Set/Reset Mode
//			TA1CTL = TASSEL_2 + MC_1;       // 2: TACLK = SMCLK
		}

	}
}

/**
 * Haptics_StartPWM - Stop PWM clocks and disable the haptics driver
 * @param unsigned char inputMode - the input mode of the current waveform
 */
void Haptics_Stop(uint8_t inputMode)
{
	if(playEffect)
	{
		Haptics_EffectActive(0);					// Set effect playback flag to inactive

		/* Reset DRV260x to default register settings */
		I2C_WriteSingleByte(DRV260x_CONTROL1, control1);
		I2C_WriteSingleByte(DRV260x_CONTROL2, control2);
		I2C_WriteSingleByte(DRV260x_CONTROL3, control3);

		IsERMOpenLoop = ERMDefaultOpenLoopSetting;	// Reset ERM_OpenLoop bit
		IsLRAOpenLoop = LRADefaultOpenLoopSetting;	// Reset LRA_OpenLoop bit

		Haptics_DisableAmplifier();

		if(inputMode == MODE_PWM)	// If current mode is PWM
		{
						//need to re-write for nordic
//			TA1CCR1 = 0x00;					// Reset duty cycle
//			TA1CTL = 0x0004;                // Stop PWM
//			TA1CCTL1 &= ~(OUTMOD_7 | OUT);  // PWM output = LOW
//			P3OUT &= 0xFB;					// Disable PWM GPIO
		}
	}
}

/**
 * Haptics_DefaultReset - reset control register 1-3 with default values
 */
void Haptics_DefaultReset(void)
{
	Haptics_EnableAmplifier();

	/* Reset DRV260x to default register settings */
	I2C_WriteSingleByte(DRV260x_CONTROL1, control1);
	I2C_WriteSingleByte(DRV260x_CONTROL2, control2);
	I2C_WriteSingleByte(DRV260x_CONTROL3, control3);
}

/**
 * Haptics_SetActuator - set the actuator type, call before Haptics_HardwareMode()
 * @param unsigned char actuator - acutator type
 */
void Haptics_SetActuator(uint8_t actuator)
{
	actuatorType = actuator;
}

/**
 * Haptics_IsActuatorLRA - determine actuator selected
 * @return unsigned char - actuator type (0 = ERM, 1 = LRA)
 */
uint8_t Haptics_IsActuatorLRA(void)
{
	return actuatorType;
}

/**
 * Haptics_SetTrigger - set the trigger DRV260x trigger type, call before Haptics_HardwareMode()
 * @param unsigned char trigger - trigger constant
 */
void Haptics_SetTrigger(uint8_t trigger)
{
	triggerType = trigger;
}

/**
 * Haptics_GetTrigger - get the trigger type
 * @return unsigned char - trigger type (internal = 0, ext. edge = 1, ext. level = 2)
 */
uint8_t Haptics_GetTrigger(void)
{
	return triggerType;
}

/**
 * Haptics_OutputEnableSet - enable/disable play back of all waveforms
 */
void Haptics_OutputEnableSet(uint8_t enable)
{
	playEffect = enable;
}

/**
 * Haptics_IsOutputEnabled - check if waveform play back is enabled
 */
uint8_t Haptics_IsOutputEnabled(void)
{
	return playEffect;
}

/**
 * Haptics_EffectActive - set if effect is active
 * @param unsigned char active - set activity status
 */
void Haptics_EffectActive(uint8_t active)
{
	EffectActive = active;
}

/**
 * Haptics_IsEffectActive - check if effect is active
 * @return unsigned char - 0  = inactive, 1 = active
 */
uint8_t Haptics_IsEffectActive(void)
{
	return EffectActive;
}

/**
 * Haptics_EnableAmplifier - set enable pin high
 */
void Haptics_EnableAmplifier(void)
{
			//need to re-write for nordic
	//P3OUT |= 0x03;                	// Enable Amplifier
}

/**
 * Haptics_DisableAmplifier - set enable pin low
 */
void Haptics_DisableAmplifier(void)
{
	if(Haptics_IsDisableAllowed())
		nrf_delay_ms(50); //added to compile, need to re-write
		//P3OUT &= 0xF8;             		// Disable Amplifier, Clear Trigger, Clear EN LED
}

/**
 * Haptics_SetDisabledAllowed
 * @return disabledAllowed - unsigned char - 0 = disabled not allowed, 1 = disabled allowed
 */
unsigned char Haptics_IsDisableAllowed(void)
{
	return disableAllowed;
}

/**
 * Haptics_SetDisabledAllowed
 * @param allowed - unsigned char - 0 = disabled not allowed, 1 = disabled allowed
 */
void Haptics_SetDisabledAllowed(uint8_t allowed)
{
	disableAllowed = allowed;
}

/**
 * Haptics_LoadSwitchSelect - select the on-board actuator using the load switch
 * @param unsigned char actuator 0 = ERM, 1 = LRA
 */
void Haptics_LoadSwitchSelect(uint8_t actuator)
{
	if(actuator)
		nrf_delay_ms(50); //added to compile, need to re-write
		//P2OUT |= 0x40;			// Select LRA
	else
		nrf_delay_ms(50); //added to compile, need to re-write
		//P2OUT &= 0xBF;      	// Select ERM

}

/**
 * Haptics_SetLibrary - select ROM Library (1-6)
 * @param unsigned char Library - library number 1-6
 */
void Haptics_SetLibrary(uint8_t library)
{
	I2C_WriteSingleByte(DRV260x_LIBRARY, library); 		// Select Library
}

/**
 * Haptics_SetSequenceRegister - insert a waveform into one of 8 sequence registers
 * @param unsigned char sequenceReg - register address for sequence register
 * @param unsigned char waveformIndex - index number for waveform
 */
void Haptics_SetSequenceRegister(uint8_t sequenceReg, uint8_t waveformIndex)
{
	I2C_WriteSingleByte(sequenceReg, waveformIndex);	// Set register
}

/**
 * Haptics_WaitWaveformComplete - wait for playback to complete for internal trigger waveforms
 */
void Haptics_WaitWaveformComplete(void)
{
	if(playEffect && EffectActive)
	{
		while(I2C_ReadSingleByte(DRV260x_GO) == GO)
		{
			nrf_delay_ms(500);
		}
	}
}


